#include <iostream>
#include "Task1_1.h"


int main() {
	int x1 = 3, x2 = 3;
	int y1 = 5, y2 = 5;
	//кожен макрос буде замінений препроцесором на код цього макросу
	printf("MIN(%d,%d)=%d;\n", x1, y1, MIN(x1++, y1));//в цьому випадку порівнюється перше значення (a++) та b. Внаслідок порівняння (4,5) повертаємо значення (a++) тобто (4++), що значить повертаємо
													//старе значення при порівнянні (4) та потім вже збільшуємо на 1. Тому x1 = 5
	printf("MIN(%d,%d)=%d;\n", x1, y1, MIN(++x1, y1));//аналогічно до (a++), але вже без копій, так як префіксний варіант відразу робить маніпуляції без проміжних копій. Тому x1 = 6 (6 < 5) return 5
	printf("min(%d,%d)=%d;\n", x2, y2, min(++x2, y2));//передається по значенню в функцію вже змінене значення x2 = 4 (так як префіксний варіант інкременту) (4 < 5) return 4
	printf("min(%d,%d)=%d;\n", x2, y2, min(x2++, y2));//в функцію передається старе значення x2, тобто 4, (4 < 5) return 4, та вже потім x2 збільшується на 1, тобто 5
	return 0;
}